app/controllers/blogs_controller.rb

  def show
    puts '----- /blogs GET show ------'
    # puts 'Current User.id = ' + get_current_user.id.to_s
    # autorize current user by id
    # if not a valid user will not come back
    # for this render
    puts 'GET_CURRENT_USER.ID = ' + get_current_user.id.to_s
    authorize_user(get_current_user.id)
    @user_blogs = User.find(params[:id]).blogs
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    puts 'POST /blogs Create using ' + blog_params.to_s
    puts 'author ' + params[:author].to_s
    puts 'subject ' + params[:subject].to_s
    puts 'content ' + params[:content].to_s
    puts 'usr_id ' + get_current_user.id.to_s

    authorize_user(get_current_user.id)

    @blog = Blog.new(author: params[:author], subject: params[:subject], content: params[:content], user_id: get_current_user.id)

    if @blog.save
---
INSERT INTO "blogs" ("author", "subject", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "me"], ["subject", "test"], ["content", "test my post"], ["created_at", "2017-09-08 14:58:22.785297"], ["updated_at", "2017-09-08 14:58:22.785297"]]

  def update
    puts '---- PUT /blogs/:id update ---'
    puts 'The passed params are: ' + blog_params.to_s
    puts '@blog = ' + @blog.to_s

    #only if I own it.....
    if @blog.user_id == get_current_user.id
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "content" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["content", "test my post again"], ["updated_at", "2017-09-08 14:58:59.617760"], ["id", 101]]

  def destroy
    # is this the owner ???
    authorize_user(get_current_user.id)

    puts 'DELETE /blogs/id destroy ' + get_current_user.id.to_s
    puts '@blog.user_id = ' + @blog.user_id.to_s

    if @blog.user_id == get_current_user.id
      @blog.destroy
---
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 101]]