app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Linwood"], ["LIMIT", 1]]
---
  def login
    puts '--- LOGIN ---'
    params.each do |i|
      puts i
    end
    #
    puts params[:username]
    puts params[:password]
    # #
    puts username: params[:username]
    puts password: params[:password] #= 'Linwood'
    puts user = User.find_by(username: params[:username])

SELECT "users".* FROM "users"
---
  def index
    puts '---- GET Index /users -----'
    @users = User.all